task3_current_nocylinder/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     waveFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         12;

deltaT          0.001;

writeControl    adjustableRunTime;
writeInterval   0.25;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
compression     off;

timeFormat      general;
timePrecision   6;

runTimeModifiable yes;
adjustTimeStep  yes;
maxCo           0.25;
maxAlphaCo      0.25;
maxDeltaT       0.02;

libs ( "libwaves2Foam.so" "libwaves2FoamGABC.so" );

functions
{
    surfaceElevation
    {
        type                surfaceElevation;
        libs                ( "libwaves2Foam.so" "libwaves2FoamGABC.so" );
        writeControl        adjustableRunTime;
        writeInterval       0.05;
        setFormat           raw;
        interpolationScheme cellPointFace;
        fields              (alpha.water);
        #includeIfPresent   "../waveGaugesNProbes/surfaceElevation_sets";
    }
}
